yisea123/stm32project/JD_Control/bsp/Src/bsp.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2016 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "can.h"
#include "dma.h"
//#include "sdio.h"
#include "usart.h"
#include "gpio.h"
#include "fsmc.h"
#include "rtc.h"
#include "adc.h"
#include "tim.h"
#include "main.h"
#include "stm32f4xx_it.h"
#include "shell_io.h"
#include "dev_ad5689.h"
#include "dev_ad7190.h"
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/

void Error_Handler(void);

void* MallocMem(uint16_t size)
{
	if(size)
	{
		//lint -e586 -e526 -e628
		return (void* )malloc(size);
	}

	return NULL;
}
void FreeMem(void* adr)
{
	if(adr)
	{
		//lint -e586 -e526 -e628
		free(adr);
	}

}

void OS_Use(OS_RSEMA x)
{
	if(x) xSemaphoreTakeRecursive((QueueHandle_t)x, portMAX_DELAY);
	else {}
}
void OS_Unuse(OS_RSEMA x)
{
	if(x) xSemaphoreGiveRecursive((QueueHandle_t)x);
	else {}
}

OS_RSEMA OS_CreateSemaphore(void)
{
	return (OS_RSEMA)xSemaphoreCreateRecursiveMutex();
}

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

void bsp_init(void)
{
	uint16_t data = 0x1000;
	/* Initialize all configured peripherals */
	MX_GPIO_Init();

	MX_USART1_UART_Init();
	MX_ADC1_Init();

	MX_CAN1_Init();
	MX_DMA_Init();
	MX_TIM6_Init();
	/* USER CODE BEGIN 2 */
	Init_RTC();

	if (AD7190_Init() == 0)
	{
		TraceUser("获取不到 AD7190 !\n");
		while (1)
		{
			HAL_Delay(1000);
			if (AD7190_Init())
				break;
		}
	}
	TraceUser("检测到  AD7190 !\n");
	weight_ad7190_conf();

	uint32_t weight_Zero_Data = weight_ad7190_ReadAvg(6);
	TraceUser("zero:%d\n",weight_Zero_Data);
	TraceUser("硬石DAC（AD5689）模块模拟量电压输出\n");

	AD5689_Init();
	AD5689_WriteUpdate_DACREG(DAC_A,data);
	AD5689_WriteUpdate_DACREG(DAC_B,0xFFFF-data);
	TraceUser("data:%d\n",data);
  /* USER CODE END 2 */
}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /**Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  /**Initializes the CPU, AHB and APB busses clocks
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /**Initializes the CPU, AHB and APB busses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
  /**Enables the Clock Security System
  */
  HAL_RCC_EnableCSS();

  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, ISR_PRIORITY_TICK, 0);
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */


/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
	dbg_printf("Error handler");

  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}
void delay_us(uint32_t count)
{
	// todo : need minus sp operations
	count = count * (SystemCoreClock / 1000000); // / 16;	// divider of 16 is measured by osc
	for (; count > 0; count--)
		;
}

osStatus MessagePush (uint32_t line,osMessageQId queue_id, uint32_t info, uint32_t millisec)
{
	if(queue_id == NULL)
		return osErrorResource;
//	assert_param(queue_id);
	return osMessagePut(queue_id,info, millisec);
}


osStatus SignalPush(osThreadId thread_id, int32_t signal)
{
	if(thread_id == NULL)
		return osErrorResource;

	return (osStatus)osSignalSet(thread_id,signal);
}
#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: TraceUser("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
//	while(1);
	TraceDBG(0xFFFF, "Assert Failed: %s, line: %d",file, line);
}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
